Revit 2027 API
ExternalResourceLoadData.GetLoadContext Method
 Returns an object containing information about the context of the load operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceLoadContext GetLoadContext()
Public Function GetLoadContext As ExternalResourceLoadContext
public:
ExternalResourceLoadContext^ GetLoadContext()
member GetLoadContext : unit -> ExternalResourceLoadContext
Return Value
ExternalResourceLoadContext
 An object containing information about the context of the load operation.
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace